---
kind: property
id: P:Autodesk.Revit.DB.Sweep.PathSketch
source: html/ebb2a7ee-bf45-b71b-524e-0a7067817cd1.htm
---
# Autodesk.Revit.DB.Sweep.PathSketch Property

The sketched path for the sweep.

## Syntax (C#)
```csharp
public Sketch PathSketch { get; }
```

## Remarks
If the sweep is based on selected 3d curves, this property is Nothing nullptr a null reference ( Nothing in Visual Basic) .